Repository: lifeng-88/Ebruk
Catalog: Ebruk/EbrukApp/Resources/Formula.xcstrings
Source language: en
Languages: zh_hans

# alert.title
source: Notice
zh_hans: 提示

# alert.ok
source: OK
zh_hans: 好的

# common.cancel
source: Cancel
zh_hans: 取消

# common.close
source: Close
zh_hans: 关闭

# common.delete
source: Delete
zh_hans: 删除

# common.done
source: Done
zh_hans: 完成

# common.coins
source: Coins
zh_hans: 金币

# common.coins_count
source: %lld coins
zh_hans: %lld 金币

# common.recipes_count
source: %lld recipes
zh_hans: %lld 条

# common.select
source: Select
zh_hans: 选择

# common.select_all
source: Select All
zh_hans: 全选

# common.deselect_all
source: Deselect All
zh_hans: 取消全选

# common.custom
source: Custom
zh_hans: 自创

# common.free
source: Free
zh_hans: 免费

# common.test
source: Test
zh_hans: 测试

# tab.recipes
source: Recipes
zh_hans: 配方

# tab.favorites
source: Favorites
zh_hans: 收藏

# tab.mine
source: Mine
zh_hans: 我的

# tab.settings
source: Settings
zh_hans: 设置

# language.title
source: Language
zh_hans: 语言

# language.system
source: Follow System
zh_hans: 跟随系统

# language.simplified_chinese
source: Simplified Chinese
zh_hans: 简体中文

# surface.enter_b
source: Discover
zh_hans: 发现

# surface.return_a
source: Recipes
zh_hans: 配方

# content.search_prompt
source: Search recipes or ingredients
zh_hans: 搜索配方或原料

# content.categories
source: Categories
zh_hans: 分类

# content.all
source: All
zh_hans: 全部

# content.custom_recipe
source: Custom Recipe
zh_hans: 自创配方

# content.loading
source: Loading…
zh_hans: 正在加载...

# content.loading_page_size
source: %lld per page
zh_hans: 每页 %lld 条

# content.load_more
source: Loading more…
zh_hans: 加载更多...

# content.all_loaded
source: All recipes loaded
zh_hans: 已加载全部数据

# content.load_failed
source: Load Failed
zh_hans: 加载失败

# content.retry
source: Retry
zh_hans: 重新加载

# card.unlock_to_view
source: Unlock to view full recipe
zh_hans: 解锁后查看完整配方

# card.coins_difficulty
source: %lld coins · %@
zh_hans: %lld 金币 · %@

# onboarding.welcome.subtitle
source: 143+ DIY formulas across 13 categories including cleaners, soaps, and candles.
zh_hans: 143+ 条手工配方，涵盖清洁剂、手工皂、蜡烛等 13 个分类，随时查阅学习。

# onboarding.coins.title
source: Unlock with Coins
zh_hans: 金币解锁配方

# onboarding.coins.subtitle
source: First recipe in each category is free. Others cost %lld–%lld coins based on difficulty. Daily check-in grants %lld coins. Apple IAP available.
zh_hans: 每分类首条配方免费。其余配方按难易与危险程度定价（%lld-%lld 金币），每日签到可领 %lld 金币，也支持 Apple 内购充值。

# onboarding.custom.title
source: Create & Favorite
zh_hans: 自创与收藏

# onboarding.custom.subtitle
source: Record your own recipes for free. Favorite recipes and export backups.
zh_hans: 记录你的独家配方，永久免费。收藏常用配方，支持导出备份。

# onboarding.next
source: Next
zh_hans: 下一步

# onboarding.start
source: Get Started
zh_hans: 开始使用

# onboarding.skip
source: Skip
zh_hans: 跳过

# settings.title
source: Settings
zh_hans: 设置

# settings.user_id
source: User ID
zh_hans: 用户 ID

# settings.user_id_copied
source: User ID copied
zh_hans: 已复制用户 ID

# settings.dev_id_copied
source: Device ID copied
zh_hans: 已复制设备 ID（dev_id）

# settings.user_avatar
source: User avatar
zh_hans: 用户头像

# settings.copy_user_id
source: Copy User ID
zh_hans: 复制用户 ID

# settings.user_id_footer
source: For support and feedback. Tap the button to copy.
zh_hans: 用于客服支持与问题反馈，点击右侧按钮可复制。

# settings.appearance
source: Appearance
zh_hans: 外观

# settings.theme
source: Theme
zh_hans: 主题模式

# settings.reminder
source: Reminders
zh_hans: 提醒

# settings.daily_reminder
source: Daily check-in reminder
zh_hans: 每日签到提醒

# settings.reminder_time
source: Reminder time
zh_hans: 提醒时间

# settings.reminder_footer
source: A local notification at the set time reminds you to claim daily coins.
zh_hans: 开启后将在设定时间发送本地通知，提醒你领取每日签到奖励。

# settings.reminder_denied
source: Allow notifications in Settings to enable daily reminders.
zh_hans: 请在系统设置中允许通知，才能开启每日签到提醒。

# settings.coins
source: Coins
zh_hans: 金币

# settings.balance
source: Balance
zh_hans: 当前余额

# settings.recharge
source: Buy Coins
zh_hans: 充值金币

# settings.daily_checkin
source: Daily check-in +%lld
zh_hans: 每日签到 +%lld

# settings.daily_claim_ok
source: Claimed %lld coins!
zh_hans: 领取成功，获得 %lld 金币！

# settings.daily_claim_done
source: Already claimed today. Come back tomorrow.
zh_hans: 今日奖励已领取，明天再来吧。

# settings.unlocked_recipes
source: Unlocked recipes
zh_hans: 已解锁配方

# settings.purchase
source: Purchases
zh_hans: 购买

# settings.restore
source: Restore Purchases
zh_hans: 恢复购买

# settings.purchase_history
source: Purchase History
zh_hans: 购买记录

# settings.legal
source: Legal
zh_hans: 法律信息

# settings.privacy
source: Privacy Policy
zh_hans: 隐私政策

# settings.terms
source: Terms of Service
zh_hans: 服务条款

# settings.about
source: About
zh_hans: 关于

# settings.app_name_label
source: App Name
zh_hans: 应用名称

# settings.version
source: Version
zh_hans: 版本

# settings.restore_ok
source: Restored %lld purchases, %lld coins total.
zh_hans: 已恢复 %lld 笔购买，共 %lld 金币。

# settings.restore_none
source: No purchases to restore.
zh_hans: 没有需要恢复的购买记录。

# appearance.system
source: System
zh_hans: 跟随系统

# appearance.light
source: Light
zh_hans: 浅色

# appearance.dark
source: Dark
zh_hans: 深色

# recharge.title
source: Buy Coins
zh_hans: 充值金币

# recharge.restore
source: Restore Purchases
zh_hans: 恢复购买

# recharge.balance
source: Balance
zh_hans: 当前余额

# recharge.usage_unlock
source: Unlock costs %lld–%lld coins by difficulty
zh_hans: 按难易/危险定价 %lld-%lld 金币

# recharge.usage_checkin
source: Check-in +%lld/day
zh_hans: 签到 +%lld/天

# recharge.choose_package
source: Choose a package
zh_hans: 选择充值套餐

# recharge.package_hint
source: Higher tiers include more bonus coins.
zh_hans: 档位越高赠送越多，金币立即到账

# recharge.recommended
source: Popular
zh_hans: 推荐

# recharge.bonus
source: %lld bonus
zh_hans: %lld 赠送

# recharge.free_section
source: Earn for free
zh_hans: 免费获取

# recharge.daily_reward
source: Daily check-in reward
zh_hans: 每日签到奖励

# recharge.iap_note
source: Paid via Apple IAP. Coins are added instantly. Consumables don't sync across devices.
zh_hans: 通过 Apple 内购安全支付，购买后金币立即到账。消耗型商品不支持跨设备同步余额。

# recharge.buy_ok_bonus
source: Purchase successful! %lld coins (including %lld bonus).
zh_hans: 购买成功！已获得 %lld 金币（含 %lld 赠送）。

# recharge.buy_ok
source: Purchase successful! %lld coins added.
zh_hans: 购买成功！已获得 %lld 金币。

# recharge.buy_pending
source: Purchase pending. Check your balance later.
zh_hans: 购买正在处理中，请稍后查看余额。

# unlock.title
source: Unlock Recipe
zh_hans: 解锁配方

source: Unlock cost
zh_hans: 解锁费用

# unlock.balance
source: Balance
zh_hans: 当前余额

# unlock.hint
source: Unlock to view ingredients, ratios, and steps.
zh_hans: 解锁后可查看完整原材料、配方比例与加工步骤。

# unlock.spend
source: Unlock for %lld coins
zh_hans: 花费 %lld 金币解锁

# unlock.insufficient
source: Not enough coins
zh_hans: 金币不足

# unlock.claim_daily
source: Claim daily reward +%lld
zh_hans: 领取每日奖励 +%lld

# unlock.claimed
source: Claimed %lld coins!
zh_hans: 已领取 %lld 金币！

# unlock.insufficient_hint
source: Not enough coins. Buy coins or claim daily reward.
zh_hans: 金币不足，请先充值或领取每日奖励。

# favorites.title
source: My Favorites
zh_hans: 我的收藏

# favorites.empty
source: No favorites yet
zh_hans: 暂无收藏

# favorites.empty_hint
source: Tap the heart on a recipe to favorite it.
zh_hans: 在配方详情页点击爱心即可收藏。

# favorites.search
source: Search favorites
zh_hans: 搜索收藏

# favorites.batch_delete
source: Batch Delete
zh_hans: 批量删除

# favorites.delete_confirm
source: Remove %lld favorites?
zh_hans: 确定要取消收藏选中的 %lld 条配方吗？

# custom.title
source: My Recipes
zh_hans: 我的配方

# custom.empty
source: No custom recipes
zh_hans: 暂无自创配方

# custom.empty_hint
source: Tap + to create your first recipe.
zh_hans: 点击右上角按钮，创建你的第一条配方。

# custom.create
source: Create Recipe
zh_hans: 创建配方

# custom.search
source: Search custom recipes
zh_hans: 搜索自创配方

# custom.batch_delete
source: Batch Delete
zh_hans: 批量删除

# custom.delete_confirm
source: Delete %lld recipes?
zh_hans: 确定要删除选中的 %lld 条自创配方吗？

# detail.share_text
source: Share as Text
zh_hans: 分享文字

# detail.export_pdf
source: Export PDF
zh_hans: 导出 PDF

# detail.print
source: Print Recipe
zh_hans: 打印配方

# detail.export_share
source: Export & Share
zh_hans: 导出与分享

# detail.unfavorite
source: Remove Favorite
zh_hans: 取消收藏

# detail.favorite
source: Favorite
zh_hans: 收藏

# detail.edit
source: Edit
zh_hans: 编辑

# detail.export_failed
source: Export Failed
zh_hans: 导出失败

# detail.delete_recipe
source: Delete Recipe
zh_hans: 删除配方

# detail.delete_confirm
source: Delete this custom recipe? This cannot be undone.
zh_hans: 确定要删除这条自创配方吗？此操作不可恢复。

# detail.custom_recipe
source: Custom recipe
zh_hans: 自创配方

# detail.recipe_id
source: Recipe #%lld
zh_hans: 配方编号 %lld

# detail.materials
source: Ingredients
zh_hans: 原材料

# detail.ratio
source: Ratio
zh_hans: 配方比例

# detail.steps
source: Steps
zh_hans: 加工步骤

# detail.safety
source: Safety Note
zh_hans: 安全提示

# editor.basic
source: Basic Info
zh_hans: 基本信息

# editor.name
source: Recipe name
zh_hans: 配方名称

# editor.category
source: Category
zh_hans: 分类

# editor.ingredients
source: Ingredients
zh_hans: 原材料

# editor.add_ingredient
source: Add ingredient
zh_hans: 添加原料

# editor.steps
source: Steps
zh_hans: 加工步骤

# editor.safety
source: Safety note (optional)
zh_hans: 安全提示（可选）

# editor.save
source: Save
zh_hans: 保存

# editor.create_title
source: New Recipe
zh_hans: 新建配方

# editor.edit_title
source: Edit Recipe
zh_hans: 编辑配方

# editor.validation
source: Please enter a name and at least one ingredient.
zh_hans: 请填写配方名称并至少添加一种原料。

# editor.ingredient_name
source: Ingredient
zh_hans: 原料名称

# editor.amount
source: Amount
zh_hans: 用量

# backup.title
source: Data Backup
zh_hans: 数据备份

# backup.export
source: Export Backup
zh_hans: 导出备份

# backup.import
source: Import Backup
zh_hans: 导入备份

# backup.footer
source: Backup includes custom recipes, favorites, coins, and unlocks. Import overwrites current data.
zh_hans: 备份包含自创配方、收藏、金币余额和解锁记录。导入将覆盖当前数据，建议先导出一份现有备份。

source: Backup Contents
zh_hans: 备份内容

# backup.custom_recipes
source: Custom recipes
zh_hans: 自创配方

# backup.favorites
source: Favorites
zh_hans: 收藏

# backup.coin_balance
source: Coin balance
zh_hans: 金币余额

# backup.unlocked
source: Unlocked
zh_hans: 已解锁

# backup.import_confirm
source: Confirm Import
zh_hans: 确认导入

# backup.import_overwrite
source: Overwrite Import
zh_hans: 覆盖导入

# backup.export_failed
source: Export failed: %@
zh_hans: 导出失败：%@

# backup.import_ok
source: Import successful.
zh_hans: 导入成功。

# backup.import_failed
source: Import failed: %@
zh_hans: 导入失败：%@

# purchase.empty
source: No records
zh_hans: 暂无记录

# purchase.empty_hint
source: Successful purchases appear here.
zh_hans: 成功购买金币后，记录将显示在这里。

# purchase.title
source: Purchase History
zh_hans: 购买记录

# unlocked.title
source: Unlocked Recipes
zh_hans: 已解锁配方

# unlocked.empty
source: No unlocked recipes
zh_hans: 暂无解锁记录

# unlocked.empty_hint
source: Recipes you unlock with coins appear here.
zh_hans: 使用金币解锁配方后，将显示在这里。

# policy.unlock_not_enough
source: Not enough for 1 recipe
zh_hans: 暂不足解锁 1 条配方

# policy.unlock_about
source: About %lld recipes
zh_hans: 约 %lld 条配方

# policy.unlock_range
source: About %lld–%lld recipes
zh_hans: 约 %lld–%lld 条配方

# package.badge.popular
source: Hot
zh_hans: 热门

# package.badge.value
source: Best Value
zh_hans: 超值

# package.badge.premium
source: Premium
zh_hans: 尊享

# difficulty.simple
source: Easy
zh_hans: 简单

# difficulty.normal
source: Normal
zh_hans: 一般

# difficulty.moderate
source: Moderate
zh_hans: 中等

# difficulty.challenging
source: Hard
zh_hans: 较难

# difficulty.hazardous
source: High risk
zh_hans: 高危

# difficulty.extreme
source: Extreme risk
zh_hans: 极高危

# notification.checkin.title
source: Daily Check-in
zh_hans: 每日签到

# notification.checkin.body
source: Your daily reward is waiting. Open the app to claim %lld coins!
zh_hans: 今日签到奖励尚未领取，打开应用领取 %lld 金币吧！

# category.cleaner
source: Cleaner
zh_hans: 清洁剂

# category.lubricant
source: Lubricant
zh_hans: 润滑油

# category.paint
source: Paint
zh_hans: 颜料

# category.glue
source: Glue
zh_hans: 胶水

# category.fragrance
source: Fragrance
zh_hans: 香料

# category.detergent
source: Detergent
zh_hans: 洗涤剂

# category.cosmetics
source: Cosmetics
zh_hans: 化妆品

# category.fertilizer
source: Fertilizer
zh_hans: 肥料

# category.candle
source: Candle
zh_hans: 蜡烛

# category.soap
source: Handmade Soap
zh_hans: 手工皂

# category.repellent
source: Repellent
zh_hans: 驱虫剂

# category.preservative
source: Preservative
zh_hans: 防腐剂

# category.other
source: Other
zh_hans: 其他

# unit.ml
source: mL
zh_hans: 毫升

# unit.l
source: L
zh_hans: 升

# unit.g
source: g
zh_hans: 克

# unit.kg
source: kg
zh_hans: 千克

# unit.piece
source: pcs
zh_hans: 个

# unit.spoon
source: spoon
zh_hans: 勺

# unit.drop
source: drop
zh_hans: 滴

# unit.portion
source: portion
zh_hans: 份

# unit.as_needed
source: as needed
zh_hans: 适量

# legal.privacy.title
source: Privacy Policy
zh_hans: 隐私政策

# legal.terms.title
source: Terms of Service
zh_hans: 服务条款

# coin.balance_a11y
source: Coin balance, tap to recharge
zh_hans: 金币余额，点击充值

# editor.new_title
source: New Recipe
zh_hans: 创建配方

# editor.validation_title
source: Please complete the form
zh_hans: 请完善信息

# editor.validation_message
source: Enter a recipe name, at least one ingredient, and steps.
zh_hans: 请填写配方名称、至少一条配料和加工步骤。

# editor.ingredients_header
source: Ingredients
zh_hans: 配料清单

# editor.ingredients_count
source: %lld items
zh_hans: %lld 项

# editor.ratio_preview
source: Ratio preview
zh_hans: 配方比例预览

# editor.ratio_footer
source: Enter ingredients and amounts to auto-generate the ratio.
zh_hans: 填写原料名称、数量并选择单位，保存后自动生成配方比例。

# editor.add_ingredient_row
source: Add ingredient
zh_hans: 添加配料

# editor.quantity
source: Amount
zh_hans: 数量

# editor.unit
source: Unit
zh_hans: 单位

# editor.safety_placeholder
source: Safety notes
zh_hans: 填写注意事项

# backup.import_summary
source: The following will overwrite current data: • Custom recipes %lld • Favorites %lld • Coins %lld • Unlocked %lld
zh_hans: 将导入以下数据并覆盖现有内容： • 自创配方 %lld 条 • 收藏 %lld 条 • 金币 %lld • 已解锁 %lld 条

# backup.invalid_format
source: Invalid file. Choose a JSON backup exported from this app.
zh_hans: 文件格式无效，请选择本应用导出的 JSON 备份。

# backup.unsupported_version
source: Backup version is too new. Update the app to import.
zh_hans: 备份版本过新，请更新应用后再导入。

# backup.read_failed
source: Read failed: %@
zh_hans: 读取失败：%@

# backup.select_failed
source: File selection failed: %@
zh_hans: 选择文件失败：%@

# backup.import_success_detail
source: Import successful! Restored %lld custom recipes.
zh_hans: 导入成功！已恢复 %lld 条自创配方。

# common.delete_count
source: Delete (%lld)
zh_hans: 删除(%lld)

# custom.delete_confirm_permanent
source: Delete %lld custom recipes? This cannot be undone.
zh_hans: 确定要删除选中的 %lld 条自创配方吗？此操作不可恢复。

# content.loaded_summary
source: Loaded %lld of %lld recipes
zh_hans: 已加载 %lld / 共 %lld 个

# content.load_error_retry
source: Failed to load recipes. Please try again.
zh_hans: 数据加载失败，请重试

# content.load_more_error
source: Failed to load more. Please try again.
zh_hans: 加载更多失败，请重试

# share.category
source: Category: %@
zh_hans: 分类：%@

# share.materials_header
source: Ingredients:
zh_hans: 原材料：

# share.none
source: (none)
zh_hans: （无）

# share.ratio_header
source: Ratio:
zh_hans: 配方比例：

# share.steps_header
source: Steps:
zh_hans: 加工步骤：

# share.safety_header
source: Safety Note:
zh_hans: 安全提示：

# pdf.category
source: Category: %@
zh_hans: 分类：%@

# pdf.exported_at
source: Exported at: %@
zh_hans: 导出时间：%@

# pdf.filename_prefix
source: Formula_
zh_hans: 手工配方_
